Revit 2027 API
NumberingSchemaTypes.StructuralNumberingSchemas Class
Note: This API is now obsolete.
 A collection of types of built-in Numbering Schemas that are used for numbering structure elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Schemas are no longer defined as unique based on this, the Name property is used.")]
public static class StructuralNumberingSchemas
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Schemas are no longer defined as unique based on this, the Name property is used.")>
Public NotInheritable Class StructuralNumberingSchemas
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit. Schemas are no longer defined as unique based on this, the Name property is used.")]
public ref class StructuralNumberingSchemas abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Schemas are no longer defined as unique based on this, the Name property is used.")>]
type StructuralNumberingSchemas = class end
The NumberingSchemaTypes.StructuralNumberingSchemas type exposes the following members.
Properties
Name | Description
Rebar |  Built-in schema used for numbering rebar elements
RebarCoupler |  Built-in schema used for numbering rebar coupler elements
ReinforcementFabric |  Built-in schema used for numbering fabric reinforcement elements
Top
See Also
Reference
Autodesk.Revit.DB Namespace